# Null value handeling

In [12]:
import pandas as pd

In [13]:
students_performance = pd.read_csv(
    r"D:\AI ML ENGINEERING JOURNY\02_Python_Foundations\04_Pandas\dataset\students_performance.csv")

In [14]:
students_performance

,student_id,name,age,gender,math_score,english_score,attendance_percentage,parent_income
0,101,Aman,20.0,M,78.0,85.0,92.0,50000.0
1,102,Riya,19.0,F,88.0,NaN,95.0,60000.0
2,103,Karan,21.0,M,67.0,72.0,NaN,45000.0
3,104,Sneha,20.0,F,NaN,90.0,88.0,NaN
4,105,Arjun,22.0,M,91.0,89.0,96.0,75000.0
5,106,Pooja,19.0,F,73.0,68.0,85.0,40000.0
6,107,Rahul,NaN,M,84.0,79.0,90.0,52000.0
7,108,Anjali,20.0,F,95.0,92.0,98.0,80000.0
8,109,Vikram,21.0,M,59.0,65.0,70.0,NaN
9,110,Neha,19.0,F,82.0,NaN,93.0,58000.0

In [15]:
students_performance.isnull().sum()

student_id               0
name                     0
age                      1
gender                   0
math_score               1
english_score            2
attendance_percentage    1
parent_income            2
dtype: int64

In [16]:
students_performance["age"] = students_performance["age"].fillna(
    students_performance["age"].mode()[0])

In [17]:
students_performance

,student_id,name,age,gender,math_score,english_score,attendance_percentage,parent_income
0,101,Aman,20.0,M,78.0,85.0,92.0,50000.0
1,102,Riya,19.0,F,88.0,NaN,95.0,60000.0
2,103,Karan,21.0,M,67.0,72.0,NaN,45000.0
3,104,Sneha,20.0,F,NaN,90.0,88.0,NaN
4,105,Arjun,22.0,M,91.0,89.0,96.0,75000.0
5,106,Pooja,19.0,F,73.0,68.0,85.0,40000.0
6,107,Rahul,19.0,M,84.0,79.0,90.0,52000.0
7,108,Anjali,20.0,F,95.0,92.0,98.0,80000.0
8,109,Vikram,21.0,M,59.0,65.0,70.0,NaN
9,110,Neha,19.0,F,82.0,NaN,93.0,58000.0

In [18]:
students_performance["age"].value_counts()

age
19.0    4
20.0    3
21.0    2
22.0    1
Name: count, dtype: int64

# Handling Null Values in the `age` Column

### Code Used

```python
students_performance["age"] = students_performance["age"].fillna(
    students_performance["age"].mode()[0]
)
```

---

## What This Code Does (Step-by-Step)

### 1️⃣ Select the Column
```python
students_performance["age"]
```
Selects the `age` column from the DataFrame.

---

### 2️⃣ Fill Missing Values
```python
.fillna(students_performance["age"].mode()[0])
```

- Finds the **mode** (most frequent value) of the `age` column.
- Replaces only the `NaN` (missing) values.
- Does NOT modify existing valid values.

---

### 3️⃣ Assign Back to the DataFrame
```python
students_performance["age"] = ...
```

- Updates the original `age` column.
- Ensures changes are saved properly.
- Avoids chained assignment errors.

---

## Example

### Before Filling

| age |
|------|
| 20 |
| 19 |
| NaN |
| 22 |

Mode = 19

---

### After Filling

| age |
|------|
| 20 |
| 19 |
| 19 |
| 22 |

✔ Existing values remain unchanged
✔ Only missing values are replaced

---

## Verification

```python
students_performance["age"].isnull().sum()
```

Expected Output:

```
0
```

This confirms all null values have been handled successfully.